{
  "auto_mapping": null,
  "base_model_name_or_path": "microsoft/phi-2",
  "encoder_hidden_size": 2560,
  "inference_mode": true,
  "modules_to_save": null,
  "num_attention_heads": 32,
  "num_layers": 32,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 20,
  "peft_type": "PREFIX_TUNING",
  "peft_version": "0.18.1",
  "prefix_projection": true,
  "revision": null,
  "task_type": "CAUSAL_LM",
  "token_dim": 2560
}